<?php
	
	$wlpe_lang = array();
	
	//WebLoginPE Class language strings.
	$wlpe_lang[0] = 'Вы оставили некоторые необходимые поля формы пустыми. Эти поля отмечены знаком <b>*</b>';
	$wlpe_lang[1] = 'Ваше имя пользователя слишком длинное. Оно должно быть не длиннее 20 символов. ';
	$wlpe_lang[2] = '[+000+] полей, введенные Вами не совпадают. Пожалуйста, повторите попытку.'; 
	$wlpe_lang[3] = 'Вы ввели слишком короткий пароль. Пожалуйста, используйте не менее 6 цифр и / или букв. ';
	$wlpe_lang[4] = 'Ваш пароль содержит недопустимые символы. Пожалуйста, используйте только буквы [AZ] [AZ] и цифры [0-9]. '; 
	$wlpe_lang[5] = 'Вы оставили некоторые необходимые поля формы пустыми. '; 
	$wlpe_lang[6] = 'Неверный код. Пожалуйста, введите правильный код, который отображается на изображении. '; 
	$wlpe_lang[7] = 'Извините, этот login уже используется. Пожалуйста, выберите другое имя пользователя. '; 
	$wlpe_lang[8] = 'Извините, пользователь с таким адресом электронной почты уже существует. Вы не можете использовать этот адрес еще раз. '; 
	$wlpe_lang[9] = 'Произошла ошибка при попытке зарегистрировать Вашу учетную запись. '; 
	$wlpe_lang[10] = 'Произошла ошибка при попытке сохранить информацию в Ваш профиль. '; 
	$wlpe_lang[11] = 'Произошла ошибка при попытке обновить веб-группы. '; 
	$wlpe_lang[12] = 'Ошибка при отправке почты. Обратитесь к администратору сайта. '; 
	$wlpe_lang[13] = 'Произошла ошибка при удалении Вашей учетной записи. '; 
	$wlpe_lang[14] = 'Активных учетный записей с указанным адресом электронной почты не найдено. ';
	$wlpe_lang[15] = 'Ошибка при загрузке учетной записи пользователя. Обратитесь к администратору сайта. ';
	$wlpe_lang[16] = 'Неверный пароль или пароль ключа активации. Ваша учетная запись не была активирована. '; 
	$wlpe_lang[17] = 'Возникла ошибка при активации пароля. Обратитесь к администратору сайта. ';
	$wlpe_lang[18] = 'Неверный пароль. Пожалуйста, повторите попытку. ';
	$wlpe_lang[19] = 'Вы допустили слишком много неверных попыток входа. Вы были заблокированы. Вы можете повторить попытку через [+000+] минут. ';
	$wlpe_lang[20] = '<p>Неверный пароль.</p><p>Вы допустили [+000+] неверных попыток ввести пароль. Вы будете заблокированы на [+111+] минут, если в течение еще [+222+] попыток допустите ошибку.</p><p>Пожалуйста, попробуйте еще раз.</p><p>Может стоит <a href="[~[*id*]~]?service=forgot">напомнить</a> Вам пароль?</p>';
	$wlpe_lang[21] = 'Имя пользователя, которое вы ввели, не существует. '; 
	$wlpe_lang[22] = 'Из-за слишком большого числа неудачных попыток входа, Вы были заблокированы!'; 
	$wlpe_lang[23] = 'Вы заблокировали и не можете войти!'; 
	$wlpe_lang[24] = 'Вы не можете войти сейчас. Вы заблокировали на следующие [+000+] минут. '; 
	$wlpe_lang[25] = 'Вы не можете войти с этого места. '; 
	$wlpe_lang[26] = 'Вы не можете войти сейчас. Пожалуйста, повторите попытку позже. '; 
	$wlpe_lang[27] = 'Неверный формат даты Вашего рождения. Пожалуйста, используйте MM-DD-YYYY '; 
	$wlpe_lang[28] = 'Ваша фотография слишком большая. Используйте файл не более [+000+] Kb';
	$wlpe_lang[29] = 'Ошибка загрузки фотографии. Пожалуйста, свяжитесь с администратором сайта. '; 
	$wlpe_lang[30] = 'Файл фотографии может иметь следующие расширения (типы) ".jpeg" или ".gif" ';
	$wlpe_lang[31] = 'Указанный чанк не существует или не содержит данных. Шаблон умолчанию будет вставлен на его место.  Пожалуйста, проверьте правильность написания. ';
	$wlpe_lang[32] = 'Ваше имя пользователя содержит недопустимые символы. Пожалуйста, используйте только буквы и цифры. '; 
	$wlpe_lang[33] = '... увы, это неизвестно';
	$wlpe_lang[34] = 'Вы должны принять Условия предоставления услуг. ';
	$wlpe_lang[35] = 'Неактивированный пользователь был удален. ';
	$wlpe_lang[36] = 'Пользователь "[+000+]" Был удален. "[+000+]" был зарегистрирован [+111+], но не активировал учетную запись. ';
	$wlpe_lang[37] = 'Ваше сообщение было отправлено ';
	$wlpe_lang[38] = 'Приватно ';
	$wlpe_lang[39] = 'Страна</br>';
	$wlpe_lang[40] = 'Пол';
	$wlpe_lang[41] = 'на сайте';
	$wlpe_lang[42] = 'отсутсвует';
	
	//Snippet Strings
	$wlpe_lang[100] = 'Проверить электронную почту для получения более подробной информации о Вашей новой учетной записи. Если вы не получили письмо, свяжитесь с администратором сайта через форму обратной связи. '; 
	$wlpe_lang[101] = 'Учетная запись обнавлена. ';
	$wlpe_lang[102] = 'Ваша учетная запись удалена. ';
	$wlpe_lang[103] = 'Проверить электронную почту для получения инструкций о том, как активировать ваш новый пароль. '; 
	$wlpe_lang[104] = 'Ваш новый пароль был активирован ';
	$wlpe_lang[105] = 'There is no language file by the name you provided. The English language file will be used instead. ';
	$wlpe_lang[106] = 'Г-н';
	$wlpe_lang[107] = 'Г-жа';
?>