<?php
   
   $wlpe_lang = array();
   
   //WebLoginPE Class language strings.
   $wlpe_lang[0] = 'Вы оставили незаполненными поля, обязательные для заполнения.';
   $wlpe_lang[1] = 'Имя пользователя слишком длинное. Оно может состоять максимум из 20 символов.';
   $wlpe_lang[2] = 'Введённые пароли не совпадают. Повторите попытку.';
   $wlpe_lang[3] = 'Используемый вами пароль слишком короткий. Используйте как минимум 6 цифр или букв.';
   $wlpe_lang[4] = 'В пароле использованы недопустимые символы. Используйте буквы [a-z][A-Z] или цифры [0-9].';
   $wlpe_lang[5] = 'Вы оставили незаполненными поля, обязательные для заполнения';
   $wlpe_lang[6] = 'Введенные вами символы не соответствуют проверочному слову. Повторите попытку.';
   $wlpe_lang[7] = 'Извините, но данное имя пользователя уже существует. Выберите другое имя.';
   $wlpe_lang[8] = 'Извините, но пользователь с таким почтовым ящиком  уже существует. 
   Вы не можете использовать данный почтовый ящик';
   $wlpe_lang[9] = 'Произошла ошибка при попытке регистрации учётной записи.';
   $wlpe_lang[10] = 'Произошла ошибка при попытке сохранения   информационного  профиля.';
   $wlpe_lang[11] = 'Произошла ошибка при попытке обновления  учётной записи.';
   $wlpe_lang[12] = 'Произошла ошибка при отправке почты. Обратитесь к администратору сайта.';
   $wlpe_lang[13] = 'В результате ошибки ваш профиль был удалён.';
   $wlpe_lang[14] = 'Для этого почтового ящика нет активного профиля.';
   $wlpe_lang[15] = 'Произошла ошибка во время загрузки профиля пользователя. Обратитесь 
   к администратору сайта.';
   $wlpe_lang[16] = 'Недействительный пароль или ключ активации пароля. Ваш профиль не был активирован.';
   $wlpe_lang[17] = 'Произошла ошибка во время активации пароля. Приносим свои извинения.';
   $wlpe_lang[18] = 'Вы ввели неверный пароль. Повторите попытку.';
   $wlpe_lang[19] = 'Несколько раз подряд  введено  неправильное регистрационное имя. 
   Доступ заблокирован. Повторите попытку через [+000+] минут.';
   $wlpe_lang[20] = '

Введён неверный пароль. Вы будете заблокированы на [+111+] минут, если количество неверных попыток будет больше [+222+] раз.

Повторите попытку.

   

Возможно, вы забыли ваш пароль?
';
   $wlpe_lang[21] = 'Имени  пользователя, введённого вами,  не существует.';
   $wlpe_lang[22] = 'По причине многократно неправильно введенного регистрационного 
   имени доступ заблокирован!';
   $wlpe_lang[23] = 'Доступ заблокирован. Вы не можете войти в систему!';
   $wlpe_lang[24] = 'Доступ в систему закрыт. Повторите попытку через [+000+] минут.';
   $wlpe_lang[25] = 'Вы не можете войти в систему с данного адреса.';
   $wlpe_lang[26] = 'Регистрация запрещена. Повторите попытку позже.';
   $wlpe_lang[27] = 'Произошла ошибка при вводе даты рождения. Нарушен формат представления 
   времени и даты. Пожалуйста,  используйте формат MM-DD-YYYY.';
   $wlpe_lang[28] = 'Слишком большой снимок. Соблюдайте размер (не больше [+000+] Kb)';
   $wlpe_lang[29] = 'Не удаётся переслать фото. Проверьте, есть ли разрешение 
   на запись в папку "userimages".';
   $wlpe_lang[30] = 'Файл с фотографией пользователя  должен соответствовать типу 
   электронной корреспонденции "image/jpeg", "image/gif", или "image/png".';
   $wlpe_lang[31] = 'Часть переданного вами  имени не существует или не содержит 
   данных. Проверьте орфографию. На этом месте будет использован шаблон, 
   установленный по умолчанию.';
   $wlpe_lang[32] = 'В пароле использованы недопустимые символы. 
   Используйте буквы [a-z][A-Z] или цифры [0-9].';
   $wlpe_lang[33] = 'Неизвестная величина.';
   $wlpe_lang[34] = 'Вы должны ознакомиться с правилами сервиса.';
   $wlpe_lang[35] = 'Неактивированный пользователь был удален.';
   $wlpe_lang[36] = 'Пользователь "[+000+]" удалён.';
   $wlpe_lang[37] = 'Ваше сообщение отправлено.';
   $wlpe_lang[38] = 'Частный';
   $wlpe_lang[39] = 'Страна';
   $wlpe_lang[40] = 'Пол';
   $wlpe_lang[41] = 'Режиме онлайн';
   $wlpe_lang[42] = 'Вне Интернета';
   
   //Snippet Strings
   $wlpe_lang[100] = 'Посмотрите подробную  информацию о новом профиле 
   в вашем почтовом ящике. ';
   $wlpe_lang[101] = 'Ваш информационный профиль обновлён.';
   $wlpe_lang[102] = 'Ваш информационный профиль был удалён.';
   $wlpe_lang[103] = 'Получите подробную инструкцию по активации нового 
   пароля в вашем почтовом ящике.';
   $wlpe_lang[104] = 'Ваш новый пароль был активирован.';
   $wlpe_lang[105] = 'Нет языкового файла у имени, предоставленного вами.
    В качестве замены будет использован английский языковой файл.';
   $wlpe_lang[106] = 'Г-н';
   $wlpe_lang[107] = 'Г-жа';
?>